ProT3_31848904/app/Controllers/Usuario.php

    public function guardar()
    {
        $validation = $this->validate([
            'nombre'   => 'required|min_length[3]',
            'apellido' => 'required|min_length[3]|max_length[25]',
            'usuario'  => 'required|min_length[3]',
            'email'    => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
            'password' => 'required|min_length[3]|max_length[10]'
        ]);

        if (!$validation) {
            $data['titulo'] = 'Registro';
            echo view('front/header', $data);
            echo view('back/usuario/registro', ['validacion' => $this->validator]);
            echo view('front/footer');
        } else {
            $usuarioModel = new UsuarioModel();

            $usuarioModel->save([
                'nombre'    => $this->request->getVar('nombre'),
                'apellido'  => $this->request->getVar('apellido'),
                'usuario'   => $this->request->getVar('usuario'),
                'email'     => $this->request->getVar('email'),
                'pass'      => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
                'perfil_id' => 2,
                'baja'      => 'NO'
            ]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`, `perfil_id`, `baja`) VALUES ('Miguel', 'Martinez', 'Mig', 'miguel@martinez.com', '$2y$10$7rPcwN2MfVdERdgq8LtHjO1/3jO2j.VOgnDAInp.5PaV7NWoyvHwi', 2, 'NO')

    public function ingresar()
    {
        $usuario = $this->request->getPost('usuario');
        $password = $this->request->getPost('password');

        $db = \Config\Database::connect();
        $builder = $db->table('usuarios');
        $builder->where('baja', 'NO');
        $builder->groupStart()
            ->where('usuario', $usuario)
            ->orWhere('email', $usuario)
            ->groupEnd();
        $query = $builder->get();
---
SELECT *
FROM `usuarios`
WHERE `baja` = 'NO'
AND   (
`usuario` = 'Juanchi'
OR `email` = 'Juanchi'
 )